docs/research/2026-03-07_FL_NARROWING_DESIGN.org
#+TITLE: FL Narrowing for Prologos: Definitional Trees, Needed Demand Analysis, and Function-as-Relation Unification
#+SUBTITLE: Phase 0--1 Implementation Design Document
#+AUTHOR: Prologos Research
#+DATE: 2026-03-07
#+OPTIONS: toc:3 num:t

* Abstract

This document is a Phase 0 (Research) and Phase 1 (Implementation Design)
artifact for bringing functional-logic (FL) narrowing into Prologos as a
core language feature. The goal: every ~defn~ function should be
automatically usable as a relation---queryable with unbound variables---
without the programmer writing a separate ~defr~ definition.

This is achieved through /narrowing/: the combination of unification and
term rewriting, guided by /definitional trees/ extracted from function
definitions and driven by /needed demand analysis/.

The document covers:
1. The formal foundations of narrowing and definitional trees
2. Surface syntax: ~=~ as unification and implicit narrowing via ~?~ variables
3. How definitional trees map to Prologos's existing ~defn~ infrastructure
4. Constraints derived from types, specs, traits, and properties---not a
   separate constraint language
5. A concrete design for the narrowing propagator
6. Resolved design decisions (including linearity, termination, infinite
   constructors)
7. A phased implementation roadmap (Phases 1--3)

*Implementation tracking*: See companion document =2026-03-07_NARROWING_ABSTRACT_INTERPRETATION_DESIGN.org=.

* 1. Motivation: The defn/defr Divide

** 1.1 The Current State

Prologos currently maintains two separate worlds:

- *~defn~* (functions): Define computations by pattern matching and
  reduction. Given ground inputs, produce ground outputs. Evaluated by
  the reducer (~reduction.rkt~).

- *~defr~* (relations): Define logical relationships with multiple clauses.
  Given goals with potentially unbound variables, search for all satisfying
  substitutions. Evaluated by the solver (~relations.rkt~, ~solver.rkt~).

These share syntax (both use pattern matching, both support multiple clauses)
but have completely separate evaluation mechanisms. A function ~add~ defined
with ~defn~ cannot be used in a relational query. If you want to query "which
pairs X, Y satisfy ~add X Y = 5~?", you must write a separate ~defr~
definition that mirrors the function's logic.

** 1.2 The Vision

With FL narrowing, the divide disappears:

#+begin_src prologos
spec add : <(x : Nat) -> (y : Nat) -> Nat>

defn add [x y]
  | [Zero y]    := y
  | [(Suc n) y] := [Suc [add n y]]

;; Use it forwards (rewriting):
eval [add [Suc Zero] [Suc Zero]]   ;; => Suc (Suc Zero)

;; Use it backwards (narrowing) — implicit via ? variables and =
let s = [add 5N ?y] = 13N
s.y   ;; => 8
;; s = ~[{:x 5 :y 8}]  — :x, :y from spec parameter names
#+end_src

Every ~defn~ is automatically a ~defr~. The programmer writes the function
once; the system derives the relational behavior through narrowing.

** 1.3 Why This Matters for Prologos

Prologos's design thesis is the /unification of paradigms/: dependent types,
linear types, session types, logic programming, and propagators on a single
substrate. FL narrowing is the natural bridge between the functional and logic
paradigms. Without it, the language has two separate evaluation models that
don't interoperate. With it, the boundary dissolves.

Moreover, FL narrowing enables:

- *Program synthesis*: Given a specification as a goal, narrowing searches
  for programs that satisfy it.
- *Test generation*: Given a postcondition, narrowing generates inputs.
- *Constraint solving*: Numeric functions become constraint propagators
  automatically.
- *Symbolic execution*: Functions evaluated symbolically for verification
  (connects to our model checking research).

* 2. Surface Syntax

** 2.1 ~=~ as Universal Unification

Prologos reserves ~=~ for unification (bidirectional pattern matching). In
the narrowing context, ~=~ is the single operator that triggers narrowing
when logic variables (~?~-prefixed) appear in functional expressions:

#+begin_src prologos
;; Bidirectional unification — triggers narrowing when ?vars present
[add ?x ?y] = 13N

;; In a let binding — binds the solution
let s = [add 5N ?y] = 13N
s.y   ;; => 8

;; Multiple solutions — sequence access
let s = [add ?x ?y] = 3N
s[0]   ;; => {:x 0 :y 3}
s[1]   ;; => {:x 1 :y 2}

;; Iteration over solutions
for [{:x x :y y}] in [add ?x ?y] = 13N
  [println [str x " + " y " = 13"]]
#+end_src

No ~=>~ operator is needed. ~=~ is sufficient:
- Left side is a functional expression (possibly with ~?~ variables)
- Right side is the target value (possibly with ~?~ variables)
- ~=~ asserts they unify, triggering narrowing to find substitutions

** 2.2 Implicit Narrowing via ~?~ Variables

The presence of ~?~-prefixed variables in a functional context IS the
narrowing trigger. No separate ~solve~ keyword or ~where~ clause is needed.
The system recognizes that the expression contains unbound logic variables
and automatically engages narrowing.

#+begin_src prologos
;; ?y triggers narrowing — solve is implicit
let result = [add 5N ?y] = 13N

;; Desugars internally to:
;; solve (= [add 5N ?y] 13N) → bindings

;; When all args are ground, = is just equality check (no narrowing)
[add 5N 8N] = 13N   ;; => true, no search needed
#+end_src

** 2.3 Bidirectional ~=~ in Functional Contexts

Beyond narrowing, ~=~ serves as a general bidirectional destructuring/
unification operator in functional contexts:

#+begin_src prologos
;; Constructor destructuring (left-to-right)
let [Cons h t] = my-list
;; h and t bound from my-list

;; With logic variables (right-to-left / narrowing)
let [Cons ?h ?t] = [Cons 1N [Cons 2N Nil]]
;; ?h = 1, ?t = [Cons 2N Nil]

;; Mixed — partial binding with narrowing
let [Pair ?x 5N] = [make-pair 3N 5N]
;; ?x = 3
#+end_src

The ~=~ operator's direction of information flow is determined by what is
bound and what is free. This is the fundamental FL narrowing principle:
unification subsumes both pattern matching (one direction) and synthesis
(the other direction).

