docs/research/2026-03-07_FL_NARROWING_DESIGN.org
** 2.4 The ~spec~ as Solution Schema

When narrowing produces results, the binding keys come from the ~spec~
definition's parameter names:

#+begin_src prologos
spec add : <(x : Nat) -> (y : Nat) -> Nat>

let s = [add 5N ?y] = 13N
;; s = ~[{:x 5 :y 8}]
;; :x from spec's first parameter name (bound value included)
;; :y from spec's second parameter name (narrowed value)
#+end_src

This parallels how ~schema~ provides field names for relational facts. The
~spec~ IS the schema for narrowing solutions. Parameter names provide
named access; all known bounds are collected alongside the solved unknowns.

For functions without a ~spec~, positional access is used instead:

#+begin_src prologos
;; No spec — positional result
defn add [x y]
  | [Zero y]    := y
  | [(Suc n) y] := [Suc [add n y]]

let s = [add 5N ?y] = 13N
;; s = ~[{:arg0 5 :arg1 8}]   or just positional access s[0].1
#+end_src

* 3. Formal Foundations

** 3.1 Term Rewriting Systems

A /term rewriting system/ (TRS) $R$ is a set of rules $l \to r$ where $l$
(the left-hand side) is a term with variables and $r$ (the right-hand side)
is a term whose variables are a subset of $l$'s variables.

A /rewrite step/ $s \to_R t$ replaces a subterm of $s$ that matches some
rule's LHS with the corresponding RHS:
- Find position $p$ in $s$ and rule $l \to r$ in $R$ such that
  $s|_p = l\sigma$ for some substitution $\sigma$.
- Then $t = s[r\sigma]_p$.

Key: rewriting requires the subterm to already be an /instance/ of the LHS
(pattern matching).

** 3.2 Narrowing

A /narrowing step/ $s \leadsto_{R,\sigma} t$ generalizes rewriting by
allowing /unification/ instead of matching:
- Find position $p$ in $s$ (where $s|_p$ is not a variable) and a renamed
  copy of rule $l \to r$ in $R$ (sharing no variables with $s$).
- Compute the most general unifier $\sigma = mgu(s|_p, l)$.
- Then $t = s\sigma[r\sigma]_p$.

Key difference: $\sigma$ may instantiate variables in $s$. The term is
simultaneously /rewritten/ (the rule is applied) and /narrowed/ (variables
are constrained).

** 3.3 Completeness

The /Narrowing Lemma/ (Hullot 1980, Middeldorp & Hamoen 1994):

If $s\theta \to^*_R t$ for some substitution $\theta$, then there exists a
narrowing derivation $s \leadsto^*_{R,\sigma} s'$ and rewriting $t \to^*_R t'$
such that $t'$ is an instance of $s'$ and $\sigma$ is more general than
$\theta$ (restricted to $s$'s variables).

In plain language: /every rewriting solution can be found by narrowing/. This
makes narrowing a complete method for solving equational goals over a TRS.

** 3.4 Definitional Trees

*** Definition (Antoy 1992)

Let $f$ be a function of arity $n$ defined by a set of rules $R_f$. A
/definitional tree/ of $f$ is a hierarchical case analysis structure $T$
where:

1. *Rule node* $\text{Rule}(l \to r)$: A leaf containing a rewrite rule.
   The pattern $l$ is a linear term of the form $f(c_1, \ldots, c_n)$ where
   each $c_i$ is a constructor pattern.

2. *Branch node* $\text{Branch}(\pi, p, [T_1, \ldots, T_k])$: An interior
   node with:
   - $\pi$: a /pattern/ (partially instantiated term $f(t_1, \ldots, t_n)$).
   - $p$: the /inductive position/ --- the argument position being case-
     analyzed.
   - $T_1, \ldots, T_k$: child trees, one per constructor of the type at
     position $p$.
   Each child's pattern extends $\pi$ by instantiating the variable at
   position $p$ to the corresponding constructor.

3. *Exempt node* $\text{Exempt}(\pi)$: A leaf marking a position where no
   rule applies (partial function---the function is undefined for this
   pattern). May raise an error or suspend.

*** Example: ~add~

For the function:

#+begin_src prologos
defn add [x y]
  | [Zero y]    := y
  | [(Suc n) y] := [Suc [add n y]]
#+end_src

The definitional tree is:

#+begin_example
Branch(position=arg1, [
  Zero   → Rule: add(Zero, y) = y
  Suc(n) → Rule: add(Suc(n), y) = Suc(add(n, y))
])
#+end_example

*** Example: ~last~ (nested branching)

#+begin_src prologos
defn last [xs]
  | [[Cons x Nil]]         := x
  | [[Cons x [Cons y ys]]] := [last [Cons y ys]]
#+end_src

Definitional tree:

#+begin_example
Branch(position=arg1, [
  Nil         → Exempt (last [] is undefined)
  Cons(x, xs) → Branch(position=arg1.2, [
    Nil         → Rule: last(Cons(x, Nil)) = x
    Cons(y, ys) → Rule: last(Cons(x, Cons(y, ys))) = last(Cons(y, ys))
  ])
])
#+end_example

** 3.5 Inductively Sequential Functions

A function $f$ is /inductively sequential/ if its defining rules can be
organized into a definitional tree. Equivalently: the case analysis of $f$'s
arguments is /uniform/ (at each level, the same argument position is analyzed
for all patterns) and /non-overlapping/ (each input matches at most one rule).

Most functions written in natural pattern-matching style are inductively
sequential. Functions with overlapping rules (non-deterministic functions) or
guards are not, but can be handled by generalizations (or-branches,
conditional branches).

** 3.6 The Needed Narrowing Strategy

Given a goal $f(t_1, \ldots, t_n) = t$:

1. Look up the definitional tree $T$ for $f$.
2. At a *Branch* node on position $p$:
   - Let $s$ be the subterm at position $p$ in the current arguments.
   - If $s$ is a /constructor/ $c(\ldots)$: follow the child for $c$
     (deterministic step).
   - If $s$ is a /variable/ $X$: create a /choice point/ over all
     constructors $c_1, \ldots, c_k$ of the appropriate type. For each
     $c_i$, bind $X := c_i(\text{fresh vars})$ and continue down child $i$.
   - If $s$ is a /function application/ $g(\ldots)$: recursively /demand/
     the evaluation of $g$---narrow $g$ first, then retry.
3. At a *Rule* node $l \to r$: apply the rule. Unify $r\sigma$ with the
   target $t$ to further constrain variables.
4. At an *Exempt* node: fail (this branch has no solution).

*** Optimality (Antoy, Echahed, Hanus 2000)

For inductively sequential functions:

- *Minimal length*: No narrowing derivation to the same result is shorter.
- *Independent solutions*: Computed substitutions are pairwise incomparable
  (no redundant generalizations).
- *Subsumption*: When all arguments are ground, needed narrowing reduces to
  lazy evaluation (no choice points created). When all functions are
  constructors, it reduces to SLD resolution.

** 3.7 Non-Deterministic Functions

When a function has overlapping rules (multiple clauses match the same
input), it is /non-deterministic/. This is the bridge to ~defr~:

#+begin_src prologos
defn insert [x xs]
  | [x xs]           := [Cons x xs]
  | [x [Cons y ys]]  := [Cons y [insert x ys]]
#+end_src

Both clauses match ~insert 3 [Cons 1 [Cons 2 Nil]]~. In the functional-
logic paradigm, both results are returned non-deterministically. The
definitional tree has an /or-branch/ at the root:

#+begin_example
Or([
  Rule: insert(x, xs) = Cons(x, xs),
  Branch(position=arg2, [
    Nil         → Exempt,
    Cons(y, ys) → Rule: insert(x, Cons(y, ys)) = Cons(y, insert(x, ys))
  ])
])
#+end_example

Non-deterministic functions in narrowing directly correspond to relations in
logic programming. This is the formal justification for treating ~defn~ with
overlapping rules as automatically generating a ~defr~.

