docs/research/2026-03-07_FL_NARROWING_DESIGN.md


<a id="orge59b3be"></a>

## 3.8 Residuation

An alternative to narrowing for functions with unbound arguments:

-   **Narrowing**: Guess the constructor (create choice point), then continue.
-   **Residuation**: Suspend evaluation until the variable is bound by another constraint. If never bound, the goal remains suspended (residual).

Residuation is deterministic (no choice points) but incomplete (may miss solutions if nothing binds the variable). Narrowing is complete but may create exponentially many choice points.

In Prologos, residuation is *already implemented* by the propagator network: a propagator whose input cell is `bot` doesn't fire. When the cell is written, the propagator fires. This is exactly residuation.


<a id="org3c02875"></a>

# 4. Constraints from the Type System


<a id="org92cabbb"></a>

## 4.1 No `where` Clause &mdash; Types ARE Constraints

A key design decision: Prologos does not need a separate constraint syntax for narrowing. The constraint information already lives in the type system:

-   **Types** are domain constraints.
-   **Subtypes** are refined domains.
-   **Traits** are capability constraints.
-   **Properties** on `spec` definitions are axioms/rewrite rules.

This means the constraint system is the type system, repurposed for narrowing. No new constraint language is needed.


<a id="org9b9d287"></a>

## 4.2 Types as Domain Constraints

```prologos
spec add : <(x : PosInt) -> (y : PosInt) -> PosInt>

;; PosInt carries the constraint x > 0
;; Narrowing automatically restricts domain to positive integers
[add ?x ?y] = 13N
;; Domain of ?x: PosInt = [1, ∞)
;; Domain of ?y: PosInt = [1, ∞)
;; After constraint propagation: ?x ∈ [1, 12], ?y ∈ [1, 12]
```


<a id="org524b720"></a>

## 4.3 Subtypes as Refined Domains

```prologos
subtype PosInt Int via pos-to-int
;; PosInt ⊂ Int → domain of PosInt is [1, ∞)
;; The subtype registry (already implemented) provides this information
```

The subtype registry, already used for coercion and type-checking, doubles as the constraint domain specification. When narrowing encounters a variable of type `PosInt`, it reads the subtype bounds from the registry.


<a id="org6d6ad89"></a>

## 4.4 Properties as Constraint Strengtheners

```prologos
spec add
  :property commutative     ;; add x y = add y x
  :property associative     ;; add (add x y) z = add x (add y z)
  :property (identity Zero) ;; add Zero x = x
```

Properties are *axioms* that the narrowing engine can use as additional rewrite rules:

-   `commutative` means the narrowing propagator can try arguments in either order.
-   `identity Zero` means `[add Zero ?x] = ?x` can be resolved without search (the identity rule applies directly).
-   Properties become *constraint strengtheners*&mdash;they narrow the search space before enumeration begins.


<a id="orgcf5a689"></a>

## 4.5 Traits as Capability Constraints

```prologos
spec sort {A : Type} [Ord A] : <(xs : [List A]) -> [List A]>
;; [Ord A] tells the narrowing engine:
;; A must have an Ord instance. When narrowing over A's constructors,
;; only types with Ord instances are valid.
```

Trait constraints restrict the constructor universe at narrowing time. The trait instance registry (already implemented) provides the valid set.


<a id="orgb4b2193"></a>

# 5. Mapping to Prologos Infrastructure


<a id="orgc84c509"></a>

## 5.1 Definitional Trees from `defn`

A Prologos `defn` definition is parsed and elaborated into a list of clauses, each with a pattern (LHS) and body (RHS). The definitional tree can be extracted by analyzing the pattern structure:


<a id="org2b86676"></a>

### Pattern Structure in Prologos AST

After elaboration, each clause has:

-   `args`: a list of patterns (one per parameter)
-   Each pattern is: a variable (`expr-fvar`), a constructor application (`expr-app` of a `expr-ctor`), a literal, or a wildcard


<a id="org9f7dff3"></a>

### Extraction Algorithm

```
extract-definitional-tree(clauses, arg-positions):
  1. If clauses is a singleton: return Rule(clause)
  2. Find the first arg position p where clauses disagree on the
     outermost constructor:
     a. For each position, collect the set of top-level constructors
        across all clauses
     b. The "inductive position" is the first position with >1 distinct
        constructors (or a mix of constructor and variable)
  3. If no such position: clauses overlap → return Or(clauses)
  4. Group clauses by the constructor at position p
  5. For each group: recursively extract the subtree (after peeling one
     layer of pattern at position p)
  6. Return Branch(p, [(ctor1, subtree1), ..., (ctorK, subtreeK)])
```

This is a compile-time analysis&mdash;the definitional tree is computed once during elaboration and stored alongside the function definition.


<a id="org72720f1"></a>

### Handling Prologos-Specific Features

| Feature                         | Definitional Tree Mapping                                   |
|------------------------------- |----------------------------------------------------------- |
| Wildcard (`_`)                  | Variable (matches any constructor)                          |
| Literal (`42N`, `"hello"`)      | Constructor (nullary; one child per literal value)          |
| Guard (`\vert [pred x] := ...`) | Conditional branch (evaluate guard after constructor match) |
| Higher-order args               | Opaque (treat as variable; residuate — don't branch)        |


<a id="org1b82db1"></a>

## 5.2 Constructor Universe

Needed narrowing requires knowing *all constructors* of a type at each branch point (to enumerate the alternatives for a variable). In Prologos:

-   ADT definitions (`type Nat := Zero \vert [Suc Nat]`) provide the complete constructor set.
-   The type checker already tracks constructor info (stored in the global environment during elaboration).
-   At each branch node, the definitional tree records the type at the inductive position, which gives the constructor universe.
-   For types with infinite constructors (Nat, Int, String), abstract interpretation provides finite over-approximation (see §8).


<a id="orgb3e24ce"></a>

## 5.3 The Propagator Connection

Each element of the narrowing evaluation maps to a propagator network operation:

| Narrowing Concept                      | Propagator Network Operation                              |
|-------------------------------------- |--------------------------------------------------------- |
| Variable (unknown)                     | Cell at `bot`                                             |
| Known constructor                      | Cell contains constructor tag + subcells                  |
| Narrowing step (instantiate var)       | `net-cell-write` (refine cell value)                      |
| Choice point (multiple constructors)   | `atms-amb` with mutual exclusion                          |
| Deterministic step (known constructor) | Direct branch in narrowing propagator                     |
| Residuation (wait for input)           | Propagator doesn't fire (input cell is `bot`)             |
| Recursive demand                       | Chain of narrowing propagators (fire in dependency order) |
| Unification (`=`)                      | `net-cell-write` with lattice merge                       |
| Failure (exempt/no match)              | Contradiction in cell                                     |
| Solution                               | All cells at fixpoint with consistent values              |


<a id="org0ea8515"></a>

## 5.4 Term Cells

For narrowing, we need cells that hold *partial term information*. We define a *Term Lattice*:

```
TermLattice:
  bot          — nothing known
  Var(id)      — logic variable (may be unified later)
  Ctor(tag, [cell-id, ...])  — constructor with subcells
  top          — contradiction (incompatible constructors)

Merge:
  bot ⊔ x = x
  x ⊔ bot = x
  Var(a) ⊔ Var(b) = unify(a, b)  ;; union-find
  Var(a) ⊔ Ctor(t, cs) = bind(a, Ctor(t, cs))
  Ctor(t1, cs1) ⊔ Ctor(t2, cs2) =
    if t1 = t2: Ctor(t1, [merge(c1i, c2i) ...])
    else: top  ;; contradiction
```

This is a lattice: `bot` is bottom, `top` is top, and merge is a monotone join operation. Contradiction (incompatible constructors) is detected immediately.


<a id="org8636554"></a>

# 6. Narrowing Propagator Design
