docs/research/2026-03-07_FL_NARROWING_DESIGN.md


<a id="orgfa418f7"></a>

## 6.1 The Narrowing Propagator

For each function `f` with definitional tree `T`, we create a *narrowing propagator factory* that, given argument cells and a result cell, installs propagators implementing needed narrowing:

```
install-narrowing-propagators(net, f, arg-cells, result-cell, def-tree):
  match def-tree:
    Rule(lhs → rhs):
      ;; Install propagator: when arg-cells match lhs, write rhs to result-cell
      net-add-propagator(net, arg-cells, [result-cell], fire-rule(lhs, rhs))

    Branch(pos, children):
      ;; Install propagator watching cell at position `pos`
      let watched-cell = arg-cells[pos]
      net-add-propagator(net, [watched-cell], [],
        lambda(net):
          let val = net-cell-read(net, watched-cell)
          match val:
            bot → net  ;; residuate (wait for info)
            Ctor(tag, sub-cells) →
              ;; Deterministic: follow the branch for `tag`
              let child = lookup(children, tag)
              install-narrowing-propagators(...)
            Var(id) →
              ;; Non-deterministic: create amb over constructors
              let ctors = all-constructors-of-type-at(pos)
              atms-amb(net, ctors, ...)
              ;; For each constructor alternative, install child propagators
              ...)

    Or(branches):
      ;; Non-deterministic function: try all branches via amb
      atms-amb(net, branches, ...)

    Exempt(pattern):
      ;; Mark contradiction (function undefined for this pattern)
      net-cell-write(net, result-cell, 'top)
```


<a id="orgd5b8d29"></a>

## 6.2 Demand-Driven Evaluation

The narrowing propagator's behavior at a Branch node with a `bot` cell implements *residuation*: it simply doesn't fire, waiting for information. This is the default behavior for Prologos's propagator network (propagators don't fire until their input cells change).

When narrowing (not residuation) is desired, the search phase creates `amb` choices. This happens at the *branching phase* of the propagate→branch→propagate loop:

1.  Propagation runs to quiescence.
2.  If unresolved demands remain (cells at `bot` that narrowing propagators are waiting on): the search heuristic selects one such cell and creates an `amb` over its possible constructors.
3.  Propagation resumes, possibly resolving other demands.


<a id="org73f4c29"></a>

## 6.3 Interaction with the Solver Loop

The narrowing propagator integrates into the existing solver architecture:

```
narrowing-solve(goal, strategy):
  1. Create fresh arg cells and result cell
  2. Install narrowing propagators for the goal function
  3. Unify result cell with goal target (=)
  4. Read domain constraints from spec types/subtypes
  5. LOOP:
     a. run-to-quiescence
     b. IF result cell determined AND all arg cells determined:
        project spec parameter names → RETURN binding map
     c. IF contradiction: BACKTRACK
     d. Find unresolved demands (bot cells with waiting propagators)
     e. SELECT demand to resolve (variable ordering heuristic)
     f. SELECT constructor for that demand (value ordering heuristic)
     g. CREATE amb choice point
     h. GOTO 5a
```


<a id="orge71aa44"></a>

## 6.4 Backward Compatibility

The narrowing propagator is *additive*: it doesn't change how `defn` functions evaluate when called with ground arguments. In that case:

1.  All arg cells are immediately written with ground values.
2.  The narrowing propagator fires deterministically at each branch (no `amb` needed&mdash;the constructor is known).
3.  The result cell receives the function's output.
4.  This is exactly equivalent to the existing reducer behavior.

The narrowing mechanism is only activated when `?` variables appear in a functional context with `=`.


<a id="orge5ad6af"></a>

# 7. Design Decisions


<a id="orga6a5328"></a>

## D1: Residuation by Default, Narrowing on Demand

Functions *residuate* by default (wait for input). Narrowing is activated only when:

(a) A `?` variable appears in a functional expression with `=`, OR (b) The function is annotated as `:narrowable`, OR (c) The search phase encounters an unresolved demand.

Rationale: residuation is deterministic and avoids unnecessary search. Narrowing creates choice points and should only be used when search is intended.


<a id="orgd52be77"></a>

## D2: `=` as Sole Unification Operator

`=` is the single operator for unification/narrowing. No `=>` needed. The direction of information flow is determined by what is bound (ground) vs. free (`?` variable). This is consistent with Prologos's reservation of `=` for the `unify` operation and avoids adding a redundant operator.

The `=` operator's semantics in context:

-   Both sides ground: equality check (no search)
-   One side has `?` variables: narrowing (search for substitutions)
-   Both sides have `?` variables: full bidirectional unification


<a id="org1291a61"></a>

## D3: `spec` as Solution Schema

`spec` parameter names provide the keys in narrowing result bindings. All known bounds are collected alongside solved unknowns. This parallels `schema` providing field names for relational facts.


<a id="org9038e4d"></a>

## D4: Constraints from Types, Not from `where`

No `where` clause or separate constraint language. Constraints are drawn from:

-   Type annotations (domain bounds)
-   Subtypes (refined domains via subtype registry)
-   Traits (capability constraints)
-   Properties on `spec` (axioms / additional rewrite rules)


<a id="org26398d7"></a>

## D5: Definitional Tree Extraction at Elaboration Time

The definitional tree is computed during elaboration (not at query time). This is a static analysis with cost proportional to the number of clauses. The tree is stored as part of the function's metadata in the global environment.


<a id="orge754614"></a>

## D6: Constructor Universe from Type Definitions

The constructor universe at each branch point is drawn from the ADT definition. For types with infinite constructors, abstract interpretation narrows to a finite domain (Phase 2&mdash;see §8).

For polymorphic functions, the constructor universe is parameterized by the type argument. At narrowing time, the type argument must be resolved (either from the goal type or by constraint propagation) before `amb` alternatives can be created.


<a id="org35b4111"></a>

## D7: Non-Deterministic Functions Create Or-Branches

Functions with overlapping rules are treated as non-deterministic: the definitional tree has Or-branches, and narrowing creates `amb` over the alternatives. This is consistent with Curry's semantics and Prologos's existing `defr` behavior.


<a id="orgec757f4"></a>

## D8: Term Lattice for Variable Cells

Narrowing variables are represented as cells in a *Term Lattice* (§5.4). This is a new lattice type alongside the existing ones (FlatLattice, SetLattice, IntervalLattice). It integrates with the existing propagator infrastructure via the standard `net-new-cell` + merge function interface.


<a id="orgc5ffdae"></a>

## D9: ATMS Worldview Semantics for Linearity

Linear variables (QTT multiplicity 1) in narrowing branches use ATMS worldview semantics:

-   Each `amb` branch is a separate worldview under a distinct assumption.
-   Linearity is checked *per-worldview*: in each consistent worldview, the linear variable is used exactly once.
-   **Learnings ARE shared across worldviews**: nogoods are global (contradictions discovered in one branch prune all worldviews containing that assumption set), and unconditional facts (empty assumption label) are shared by all worldviews.
-   Only assumption-dependent facts are isolated (which is exactly the right isolation for linearity).

This is strictly better than chronological backtracking:

-   Backtracking forgets everything when it backtracks (no learning).
-   ATMS remembers contradictions (learning via nogoods).
-   ATMS shares unconditional derivations (no redundant computation).
